## 5.1 Index对象

In [15]:
import pandas as pd
import numpy as np

### 5.1.1 一级索引Index对象

In [16]:
data = {'a' : 3, 'b' : 2, 'c' : 0, 'd' : 1}
s = pd.Series(data)
s

a    3
b    2
c    0
d    1
dtype: int64

In [17]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 1, 2, 3],
    'bananas': [1, 2, 1, 0]
}
df = pd.DataFrame(data, index=['June','Robert','Lily','David'])
df

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
Lily         0        2        1
David        1        3        0

In [19]:
df.index

Index(['June', 'Robert', 'Lily', 'David'], dtype='object')

In [20]:
df.columns

Index(['apples', 'oranges', 'bananas'], dtype='object')

### 5.1.2 创建Index对象

In [21]:
labels = pd.Index(['a', 'b', 'c', 'd', 'e'])
s = pd.Series(np.arange(5), index=labels)
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [22]:
L =[[3,0,1], 
    [2,1,2], 
    [0,2,1], 
    [1,3,0]]
df = pd.DataFrame(L)
df

   0  1  2
0  3  0  1
1  2  1  2
2  0  2  1
3  1  3  0

In [23]:
row_labels = pd.Index(['June', 'Robert', 'Lily', 'David'])
col_labels = pd.Index(['apples', 'oranges', 'bananas'])

In [24]:
df = pd.DataFrame(L, index=row_labels, columns=col_labels)

In [25]:
df

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
Lily         0        2        1
David        1        3        0

### 5.1.3 	重建索引

In [26]:
labels = pd.Index(['a', 'b', 'c', 'd', 'e'])
s = pd.Series(np.arange(5), index=labels)
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [27]:
s1 = s.reindex(['a', 'b', 'c'])
s1

a    0
b    1
c    2
dtype: int32

In [28]:
s2 = s.reindex(['a', 'b', 'c', 'd', 'e' ,'f'])
s2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    NaN
dtype: float64

In [30]:
L =[[3,0,1], 
    [2,1,2], 
    [0,2,1], 
    [1,3,0]]
df = pd.DataFrame(L,
                  columns=['apples','oranges','bananas'], 
                  index=['June','Robert','Lily','David'])
df

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
Lily         0        2        1
David        1        3        0

In [31]:
df2 = df.reindex(['June', 'Lily', 'Robert'])
df2

        apples  oranges  bananas
June         3        0        1
Lily         0        2        1
Robert       2        1        2

In [32]:
df3 = df.reindex(columns=['apples', 'bananas', 'oranges'])
df3

        apples  bananas  oranges
June         3        1        0
Robert       2        2        1
Lily         0        1        2
David        1        0        3